k6/test_results/scenario-b-rest.txt
strucnjak@machine:~/iot-airquality-project/k6$ k6 run scenario-b-rest.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scenario-b-rest.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 3m45s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 3m15s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=3.5s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 73176  375.037791/s
    checks_succeeded...: 81.85% 59898 out of 73176
    checks_failed......: 18.14% 13278 out of 73176

    ✓ status je 200
    ✓ ima podataka
    ✗ latencija ispod 500ms
      ↳  45% — ✓ 11114 / ✗ 13278

    HTTP
    http_req_duration..............: avg=1.26s min=23.12ms  med=681.41ms max=5.43s p(90)=3.09s p(95)=3.5s
      { expected_response:true }...: avg=1.26s min=23.12ms  med=681.41ms max=5.43s p(90)=3.09s p(95)=3.5s
    http_req_failed................: 0.00%  0 out of 24392
    http_reqs......................: 24392  125.012597/s

    EXECUTION
    iteration_duration.............: avg=1.36s min=123.75ms med=782.44ms max=5.53s p(90)=3.19s p(95)=3.6s
    iterations.....................: 24392  125.012597/s
    vus............................: 4      min=1          max=500
    vus_max........................: 500    min=500        max=500

    NETWORK
    data_received..................: 75 MB  386 kB/s
    data_sent......................: 2.4 MB 12 kB/s



running (3m15.1s), 000/500 VUs, 24392 complete and 0 interrupted iterations
default ✓ [======================================] 000/500 VUs  3m15s
ERRO[0195] thresholds on metrics 'http_req_duration' have been crossed 
strucnjak@machine:~/iot-airquality-project/k6$