k6/test_results/scenario-c-rest.txt
strucnjak@machine:~/iot-airquality-project/k6$ k6 run scenario-c-rest.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scenario-c-rest.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 3m45s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 3m15s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)

WARN[0210] Request Failed                                error="request timeout"
ERRO[0211] SyntaxError: Unexpected end of JSON input (EOF)
running at parse (native)
default at ima rezultata (file:///home/strucnjak/iot-airquality-project/k6/scenario-c-rest.js:34:45(5))
        at go.k6.io/k6/v2/internal/js/modules/k6.(*K6).Check-fm (native)
        at default (file:///home/strucnjak/iot-airquality-project/k6/scenario-c-rest.js:32:8(19))  executor=ramping-vus scenario=default source=stacktrace
WARN[0212] Request Failed                                error="request timeout"
ERRO[0212] SyntaxError: Unexpected end of JSON input (EOF)
running at parse (native)
default at ima rezultata (file:///home/strucnjak/iot-airquality-project/k6/scenario-c-rest.js:34:45(5))
        at go.k6.io/k6/v2/internal/js/modules/k6.(*K6).Check-fm (native)
        at default (file:///home/strucnjak/iot-airquality-project/k6/scenario-c-rest.js:32:8(19))  executor=ramping-vus scenario=default source=stacktrace


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=2.52s

    http_req_failed
    ✓ 'rate<0.05' rate=0.02%


  █ TOTAL RESULTS 

    checks_total.......: 24820  112.393096/s
    checks_succeeded...: 96.92% 24058 out of 24820
    checks_failed......: 3.07%  762 out of 24820

    ✗ status je 200
      ↳  99% — ✓ 8272 / ✗ 2
    ✗ ima rezultata
      ↳  99% — ✓ 8272 / ✗ 2
    ✗ latencija ispod 2000ms
      ↳  90% — ✓ 7514 / ✗ 758

    HTTP
    http_req_duration..............: avg=783.71ms min=23.38ms  med=381.04ms max=1m0s   p(90)=1.93s  p(95)=2.52s 
      { expected_response:true }...: avg=769.39ms min=23.38ms  med=380.98ms max=56.06s p(90)=1.93s  p(95)=2.52s 
    http_req_failed................: 0.02%  2 out of 8274
    http_reqs......................: 8274   37.467384/s

    EXECUTION
    iteration_duration.............: avg=4.11s    min=201.74ms med=2.21s    max=1m0s   p(90)=10.71s p(95)=13.03s
    iterations.....................: 8274   37.467384/s
    vus............................: 1      min=1         max=500
    vus_max........................: 500    min=500       max=500

    NETWORK
    data_received..................: 11 GB  47 MB/s
    data_sent......................: 1.3 MB 5.9 kB/s



running (3m40.8s), 000/500 VUs, 8274 complete and 3 interrupted iterations
default ✓ [======================================] 000/500 VUs  3m15s
strucnjak@machine:~/iot-airquality-project/k6$